app/services/auth_service.rb

    def authenticate_user(email, password)
      return nil unless email && password
      user = User.find_by(email: email.downcase.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@example.com"], ["LIMIT", 1]]

    def current_user_from_token(token)
      return nil unless token

      payload = decode_token(token)
      User.find_by(id: payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]