app/services/conversation_service.rb

INSERT INTO "messages" ("conversation_id", "role", "content", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create_message(conversation, role, content)
      conversation.messages.create!(
        role: role,
        content: content
      )

UPDATE "conversations" SET "updated_at" = $1 WHERE "conversations"."id" = $2  [["updated_at", "2025-07-19 17:37:11.260750"], ["id", 6]]
---
    def update_conversation_timestamp(conversation)
      conversation.touch

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2  [["conversation_id", 6], ["LIMIT", 10]]
---
    def build_message_history(conversation, current_message, limit = 10)
      messages = []

      # Add conversation history (last N messages to keep context manageable)
      # Exclude the current message since it hasn't been saved yet
      recent_messages = conversation.messages.order(:created_at).last(limit)

SELECT "conversations".* FROM "conversations" WHERE "conversations"."session_id" = $1 AND "conversations"."id" = $2 LIMIT $3  [["session_id", "password-test"], ["id", 9], ["LIMIT", 1]]
---
    def find_conversation(conversation_id, user, session_id)
      if user
        user.conversations.find_by(id: conversation_id)
      else
        Conversation.for_session(session_id).find_by(id: conversation_id)

INSERT INTO "conversations" ("user_id", "title", "created_at", "updated_at", "session_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["title", "New conversation"], ["created_at", "2025-07-19 17:38:33.040876"], ["updated_at", "2025-07-19 17:38:33.040876"], ["session_id", nil]]
INSERT INTO "conversations" ("user_id", "title", "created_at", "updated_at", "session_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", nil], ["title", "New conversation"], ["created_at", "2025-07-19 17:37:07.553858"], ["updated_at", "2025-07-19 17:37:07.553858"], ["session_id", "5e941247-c1b9-45c9-8666-e938ff3890a9"]]
---
    def create_new_conversation(user, session_id)
      if user
        user.conversations.create!(
          title: "New conversation"
        )
      else
        Conversation.create!(
          session_id: session_id,
          title: "New conversation"
        )