app/services/user_service.rb

    def create_user_from_claude_args(args, session_id = nil)
      mapped_args = map_user_attributes(args)

      # Use provided password or generate temporary one
      if args['password'].present?
        mapped_args[:password] = args['password']
      else
        mapped_args[:password] = generate_temp_password
        Rails.logger.warn "Generated temporary password for user #{args['email']}"
      end

      user = User.new(mapped_args)

      if user.save
---
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "created_at", "updated_at", "date_of_birth", "height_cm", "weight_kg", "activity_level", "biological_sex", "time_zone", "units_preference", "onboarded_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def associate_anonymous_conversations(user, session_id)
      # Keep the session_id so we can find the user later
      Conversation.for_session(session_id).update_all(user_id: user.id)
---
UPDATE "conversations" SET "user_id" = $1 WHERE "conversations"."session_id" = $2  [["user_id", 5], ["session_id", "improved-test"]]