app/controllers/webhooks/terra_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "terra_connections".* FROM "terra_connections" WHERE "terra_connections"."user_id" = $1 AND "terra_connections"."provider" = $2 AND "terra_connections"."terra_user_id" = $3 LIMIT $4  [["user_id", 10], ["provider", "withings"], ["terra_user_id", "838d9194-967b-4a6d-b32c-09e734582011"], ["LIMIT", 1]]
---
  def handle_auth_webhook
    Rails.logger.info "Terra auth webhook received for reference_id: #{reference_id}"

    # Find the user by the reference_id (which should be the user's ID)
    user = User.find_by(id: reference_id)

    unless user
      Rails.logger.error "Could not find user with ID: #{reference_id}"
      return render json: { error: 'User not found' }, status: :not_found
    end

    provider = webhook_data['user']['provider']

    terra_connection = user.terra_connections.find_or_initialize_by(
      provider: provider.downcase,
      terra_user_id: user_id
    )

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def process_health_data(data_type)
    return unless reference_id.present?

    user = User.find_by(id: reference_id)