app/controllers/api/v1/auth_controller.rb

  def register
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "created_at", "updated_at", "date_of_birth", "height_cm", "weight_kg", "activity_level", "biological_sex", "time_zone", "units_preference", "onboarded_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"