app/controllers/api/v1/chat_controller.rb

  def send_message
    user_message = params[:message]
    conversation_id = params[:conversation_id]

    # Get or create conversation using service
    conversation = ConversationService.get_or_create_conversation(
      conversation_id,
      current_user,
      @session_id
    )

    # Create user message
    user_msg = ConversationService.create_message(conversation, 'user', user_message)

    # Get Claude response with user context
    claude_response = ClaudeService.new.chat_with_context(
      message: user_message,
      conversation: conversation,
      user_context: user_context
    )

    # Create assistant message
    assistant_msg = ConversationService.create_message(
      conversation,
      'assistant',
      claude_response[:content]
    )

    # Update conversation timestamp
    ConversationService.update_conversation_timestamp(conversation)
---
INSERT INTO "conversations" ("user_id", "title", "created_at", "updated_at", "session_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", nil], ["title", "New conversation"], ["created_at", "2025-07-19 17:08:20.021712"], ["updated_at", "2025-07-19 17:08:20.021712"], ["session_id", "dbtest"]]
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "created_at", "updated_at", "date_of_birth", "height_cm", "weight_kg", "activity_level", "biological_sex", "time_zone", "units_preference", "onboarded_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "messages" ("conversation_id", "role", "content", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "conversations" SET "updated_at" = $1 WHERE "conversations"."id" = $2  [["updated_at", "2025-07-19 17:08:25.480396"], ["id", 1]]